product/load-test/results/scenario1-lock/after/run2/warmup.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 50s max duration (incl. graceful stop):
              * warmup: 10 looping VUs for 30s (gracefulStop: 20s)

time="2026-08-05T17:52:05+09:00" level=info msg="초기 재고: 100000000" source=console

running (01.0s), 10/10 VUs, 41 complete and 0 interrupted iterations
warmup   [   3% ] 10 VUs  00.8s/30s

running (02.0s), 10/10 VUs, 92 complete and 0 interrupted iterations
warmup   [   6% ] 10 VUs  01.8s/30s

running (03.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
warmup   [   9% ] 10 VUs  02.8s/30s

running (04.0s), 10/10 VUs, 285 complete and 0 interrupted iterations
warmup   [  13% ] 10 VUs  03.8s/30s

running (05.0s), 10/10 VUs, 399 complete and 0 interrupted iterations
warmup   [  16% ] 10 VUs  04.8s/30s

running (06.0s), 10/10 VUs, 538 complete and 0 interrupted iterations
warmup   [  19% ] 10 VUs  05.8s/30s

running (07.0s), 10/10 VUs, 725 complete and 0 interrupted iterations
warmup   [  23% ] 10 VUs  06.8s/30s

running (08.0s), 10/10 VUs, 937 complete and 0 interrupted iterations
warmup   [  26% ] 10 VUs  07.8s/30s

running (09.0s), 10/10 VUs, 1143 complete and 0 interrupted iterations
warmup   [  29% ] 10 VUs  08.8s/30s

running (10.0s), 10/10 VUs, 1319 complete and 0 interrupted iterations
warmup   [  33% ] 10 VUs  09.8s/30s

running (11.0s), 10/10 VUs, 1520 complete and 0 interrupted iterations
warmup   [  36% ] 10 VUs  10.8s/30s

running (12.0s), 10/10 VUs, 1729 complete and 0 interrupted iterations
warmup   [  39% ] 10 VUs  11.8s/30s

running (13.0s), 10/10 VUs, 1928 complete and 0 interrupted iterations
warmup   [  43% ] 10 VUs  12.8s/30s

running (14.0s), 10/10 VUs, 2141 complete and 0 interrupted iterations
warmup   [  46% ] 10 VUs  13.8s/30s

running (15.0s), 10/10 VUs, 2342 complete and 0 interrupted iterations
warmup   [  49% ] 10 VUs  14.8s/30s

running (16.0s), 10/10 VUs, 2481 complete and 0 interrupted iterations
warmup   [  53% ] 10 VUs  15.8s/30s

running (17.0s), 10/10 VUs, 2677 complete and 0 interrupted iterations
warmup   [  56% ] 10 VUs  16.8s/30s

running (18.0s), 10/10 VUs, 2884 complete and 0 interrupted iterations
warmup   [  59% ] 10 VUs  17.8s/30s

running (19.0s), 10/10 VUs, 3080 complete and 0 interrupted iterations
warmup   [  63% ] 10 VUs  18.8s/30s

running (20.0s), 10/10 VUs, 3266 complete and 0 interrupted iterations
warmup   [  66% ] 10 VUs  19.8s/30s

running (21.0s), 10/10 VUs, 3470 complete and 0 interrupted iterations
warmup   [  69% ] 10 VUs  20.8s/30s

running (22.0s), 10/10 VUs, 3678 complete and 0 interrupted iterations
warmup   [  73% ] 10 VUs  21.8s/30s

running (23.0s), 10/10 VUs, 3865 complete and 0 interrupted iterations
warmup   [  76% ] 10 VUs  22.8s/30s

running (24.0s), 10/10 VUs, 4045 complete and 0 interrupted iterations
warmup   [  79% ] 10 VUs  23.8s/30s

running (25.0s), 10/10 VUs, 4224 complete and 0 interrupted iterations
warmup   [  83% ] 10 VUs  24.8s/30s

running (26.0s), 10/10 VUs, 4410 complete and 0 interrupted iterations
warmup   [  86% ] 10 VUs  25.8s/30s

running (27.0s), 10/10 VUs, 4601 complete and 0 interrupted iterations
warmup   [  89% ] 10 VUs  26.8s/30s

running (28.0s), 10/10 VUs, 4799 complete and 0 interrupted iterations
warmup   [  93% ] 10 VUs  27.8s/30s

running (29.0s), 10/10 VUs, 4988 complete and 0 interrupted iterations
warmup   [  96% ] 10 VUs  28.8s/30s

running (30.0s), 10/10 VUs, 5185 complete and 0 interrupted iterations
warmup   [  99% ] 10 VUs  29.8s/30s
time="2026-08-05T17:52:35+09:00" level=info msg="초기 재고: 100000000" source=console
time="2026-08-05T17:52:35+09:00" level=info msg="최종 재고: 99994775" source=console
time="2026-08-05T17:52:35+09:00" level=info msg="차감된 수량: 5225" source=console
time="2026-08-05T17:52:35+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    stock_unexpected_failures
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 5225    172.782815/s
    checks_succeeded...: 100.00% 5225 out of 5225
    checks_failed......: 0.00%   0 out of 5225

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 5225   172.782815/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 5225
    stock_unexpected_failure_rate...: 0.00%  0 out of 5225
    stock_unexpected_failures.......: 0      0/s

    HTTP
    http_req_duration...............: avg=57.3ms  min=7.14ms  med=49.13ms max=521.19ms p(90)=73.19ms p(95)=91.13ms p(99)=206.88ms
      { expected_response:true }....: avg=57.3ms  min=7.14ms  med=49.13ms max=521.19ms p(90)=73.19ms p(95)=91.13ms p(99)=206.88ms
    http_req_failed.................: 0.00%  0 out of 5227
    http_reqs.......................: 5227   172.848952/s

    EXECUTION
    iteration_duration..............: avg=57.45ms min=40.62ms med=49.28ms max=521.92ms p(90)=73.34ms p(95)=91.18ms p(99)=207.07ms
    iterations......................: 5225   172.782815/s
    vus.............................: 10     min=10        max=10
    vus_max.........................: 10     min=10        max=10

    NETWORK
    data_received...................: 3.1 MB 103 kB/s
    data_sent.......................: 1.0 MB 34 kB/s



running (30.2s), 00/10 VUs, 5225 complete and 0 interrupted iterations
warmup ✓ [ 100% ] 10 VUs  30s